// Напишите программу ,которая принимаетна вход три числа и выдает
// максимальное из этих чисел.
Console.WriteLine("Введите число 1");
int num1 = int.Parse(Console.ReadLine());

Console.WriteLine("Введите число 2");
int num2 = int.Parse(Console.ReadLine());

Console.WriteLine("Введите число 3");
int num3 = int.Parse(Console.ReadLine());

if(num1>num2);
{
    
}
